[
    {
        "id": "0",
        "name": "What to do if you can't pay your vet bill",
        "created_date": "January 31, 2024",
        "updated_date": "January 31, 2025",
        "category": "Care",
        "description": "When our cat Juliet broke her paw, I was heartbroken—and unprepared for the $7K surgery. Here’s how I found a lifeline and got her back to happy.",
        "content": [
            "When I moved into a new apartment in San Francisco with my two cat gals, I saw that it came with a pre-existing bunk bed. I thought, “that’s kind of cute. I like it.” And I thought the cats would have fun with that top bunk as a “cat tower” of sorts.",
            "I was right — they loved the bunk bed, especially Juliet.",
            "One day I came home from work & took a nap. When I woke up, Juliet came over to me holding her front arm & paw up as if she was in pain & couldn’t walk on it. She made the saddest crying sound I had ever heard her make. My heart immediately sank, and I of course started crying & freaking out. I had no idea what could be wrong.",
            "Panicking — I called an Uber to rush us to the closest emergency vet. After hours of waiting, they finally came out to tell me that she broke her paw. Literally all of the little paw finger bones & her wrist. I was sobbing & wished I could trade places with her. They told me I would need to take her to a surgeon ASAP. The next morning, I found a surgeon & took her down to San Mateo.",
            "The surgeon took x-rays & gave me a price estimate of what it would cost, which was over $7,000. At the time, I had just come out of a career gap so my savings account was — pretty dusty & I didn’t have any credit cards at the time. I was distraught at the thought of not being able to pay for her surgery, and started sobbing (yes, in the doctor’s office). Normally, I’m not a very emotional person, but if anything goes awry with Juliet I am almost always crying or on the verge.",
            "Anywho — while I was having my crying meltdown, a gal from the surgeon’s office brought me some information on something called CareCredit. It was a company that would loan me the money for the surgery. Oh.em.gee…what??? I figured they were going to totally rake me over the coals with interest, but that was not the case.",
            "Their offer was to give me the $7,000 loan & the first 12 months would be 0% interest. So I literally had a full year to pay the money back with no interest at all, which was a godsend. Luckily I was able to pay it off within those 12 months — yay!",
            "Normally, I’m not a fan of lenders & credit cards, but dang — CareCredit will always have a special place in my heart for having my back when Juliet needed surgery.",
            "And the best part? Juliet’s surgery went perfectly. She had a cute little cast on for a while, some weeks it had little cows on it, some weeks it had little piggies on it (and all of the weeks she was ready for it to come off LOL). Her paw is as good as new. You’d never even know anything happened—Juliet is back to her happy, jumping bean little self, ruling the apartment like the princess she is."
          ],
        "image": "juliet_window_sil",
        "article": true
    },
    {
        "id": "1",
        "name": "Automated litter boxes (like LitterRobot)",
        "created_date": "January 31, 2025",
        "updated_date": "January 31, 2025",
        "category": "Care",
        "description": "Tired of cleaning litter boxes? I explored automated options but discovered hidden risks. Find out why I stuck with the old-school approach for my cat’s safety!",
        "content": [
            "Tired of the never-ending battle with your cat’s litter box? I was too. I mean, who isn't? It’s like the unspoken war of cat ownership. You know, the kind of battle that makes you question every decision you’ve ever made. After years of scooping and cleaning, I thought, “There’s got to be a better way!” So, like any rational, sleep-deprived pet parent, I dove headfirst into the world of automated litter boxes. And, of course, I set my sights on the high-end, top-of-the-line LitterRobot. I mean, it’s sleek, it’s futuristic, and it promised to change my life—maybe even my cat’s.",
            "I spent hours scouring every review, diving deep into user testimonials, and analyzing the pros and cons like I was about to make an investment in a startup. I’m talking spreadsheets, the works. At first, it seemed like a dream: no more scooping, no more odors, no more “Why did I choose to live with these tiny furry creatures?” But as I kept digging, I stumbled upon some unsettling warnings that really made me second-guess my decision.",
            "It turns out, several veterinarians have been sounding the alarm about these automated litter boxes. Apparently, there have been reports of cats getting seriously injured—think paws caught in the mechanism, tails getting stuck, or even worse. Now, of course, I’m sure the rival brands are out there in the wilds of the internet, writing scathing reviews about their competitors. But after reading all of this, I started picturing my cat, Juliet, trying to navigate this high-tech contraption and getting trapped in the very thing that promised to make life easier. I mean, I can barely get my phone to sync with my Bluetooth speaker, let alone trust a robot to keep my cat safe and clean.",
            "So, after weighing the pros and cons, and imagining the worst-case scenario (Juliet, in her infinite wisdom, pawing at the LitterRobot, only to find herself stuck in a mechanical nightmare), I decided to stick with a more traditional approach. You know, the old-school litter box. Sure, it’s not as futuristic or as sleek, but at least I’m not risking my cat’s well-being for the sake of convenience. And if I’m being honest, Juliet probably likes the human touch anyway. She’s like, \"You know what? I’m good with the classic style. None of that robot nonsense.\" She’s also probably in on some secret cat club where they meet up to discuss how they can mess with their human’s sanity—especially when it comes to litter boxes.",
            "In the end, I realized that some things are just worth sticking with, even if it means a little extra elbow grease. Sure, it’s a bit of a hassle, but it’s a small price to pay for peace of mind. After all, you wouldn’t let a robot handle something as important as your cat’s bathroom habits, right? Let’s keep it old school—scoops and all. Because when it comes to your cat’s safety, a little bit of inconvenience is totally worth it."
          ],
        "image": "olivia_juliet_couch",
        "article": true
    },
    {
        "id": "2",
        "name": "Does your cat have kidney disease?",
        "created_date": "January 31, 2025",
        "updated_date": "January 31, 2025",
        "category": "Health",
        "description": "Olivia's Miraculous Kidney Recovery: How Rx Renal Beadlets Saved the Day",
        "content": [
            "If you’ve ever had a cat diagnosed with kidney disease, you know it can feel like your heart is breaking. Our sweet Olivia was no exception. After a routine checkup, we were told that Olivia had early-stage kidney disease. We were devastated. But little did we know, this was just the beginning of a health turnaround we never expected.",
            "Enter <a href=\"https:\/\/www.chewy.com\/rx-vitamins-rx-renal-beadlets-kidney\/dp\/192803\" target=\"_blank\" rel=\"noopener noreferrer\">Rx Renal Beadlets<\/a>, developed by Dr. Robert Silver, a veterinary pioneer with decades of experience in integrative medicine. Dr. Silver, who has a background in cardiopulmonary physiology and is a leader in veterinary herbal and nutraceutical therapies, created these little beads with one goal in mind: to support kidney health in pets. And for Olivia, they worked wonders.",
            "When we first started giving Olivia the Rx Renal Beadlets, we were cautiously optimistic. After all, kidney disease is notoriously tricky to manage. But after just a few months of consistent use, something amazing happened. Olivia’s kidney values, which had been concerning, completely reversed. The kidney disease was gone.",
            "It felt like a miracle. We couldn’t believe how something so simple could make such a profound difference. It was like watching our cat get a second chance at life. Olivia’s energy bounced back, her appetite returned to normal, and she was once again her playful, curious self—without the worry of kidney failure hanging over us.",
            "If you’re navigating a similar journey with your pet, we can’t recommend Rx Renal Beadlets enough. They gave Olivia the gift of health, and they just might do the same for your furry friend.",
            "Thank you, Dr. Silver, for giving Olivia—and so many other pets—a chance at a healthier, happier life."
          ],
        "image": "juliet_olivia_cat_tower",
        "article": true
    },
    {
        "id": "3",
        "name": "Does your cat spray pee outside the litter box?",
        "created_date": "January 31, 2025",
        "updated_date": "January 31, 2025",
        "category": "Home",
        "description": "Juliet’s High-Flying Pee Problem: How We Finally Tamed the Spray",
        "content": [
            "If you’ve ever had a cat with… let’s say, “unconventional” bathroom habits, you know the struggle. Take our cat, Juliet, for example. Not only is she a majestic ball of fluff and attitude, but she also has the curious habit of peeing so high, she’s practically trying to mark the ceiling. Yes, you read that right—Juliet doesn’t just pee in the litter box, she sprays over the sides and onto the walls. As you can imagine, this led to some questionable home decor choices: the carpet, the walls, and even the occasional light fixture were all fair game.",
            "Our first attempt at solving this involved a tarp. Oh, the tarp. We thought, “Surely, this will contain the spray!” Spoiler alert: it didn’t. The tarp was more of a suggestion than a solution. Juliet was determined to defy the laws of physics and her tiny box, leading to several rounds of laundry, frustrated sighs, and the very real fear of stepping in cat pee while we slept.",
            "What’s even better? The box has a tarp liner that slides right inside. When the inevitable happens, I can pop it out, toss it in the wash, and order a replacement liner from Amazon with just a few clicks. No more soggy carpet, no more mysterious damp spots on the walls—just a clean, dry home and a very satisfied cat (who still has her high-flying pee technique, but at least it’s now contained).",
            "So, if your cat’s bathroom habits involve a bit more drama than you’d like, trust me: invest in the high-walled, lid-covered litter box. It won’t change your cat’s quirky habits, but it might just save your walls (and your sanity).",
            "You can find the magical life-saving litter box <a href=\"https:\/\/www.amazon.com\/Modkat-Litter-Scoop-Reusable-Liner\/dp\/B009UWMLC4\" target=\"_blank\" rel=\"noopener noreferrer\">here<\/a>.."
          ],
        "image": "juliet_upside_down",
        "article": true
    },
    {
        "id": "4",
        "name": "Don't put your cats water bowl near their food",
        "created_date": "January 31, 2025",
        "updated_date": "January 31, 2025",
        "category": "Care",
        "description": "Ever wonder why your cat barely drinks water? It might be a secret mission! Discover why keeping food and water separate can boost hydration and health.",
        "content": [
            "In our house, I barely see Juliet or Olivia drinking water. In fact, I haven’t seen Olivia drink water in years—she’s like a secret agent on a hydration mission. I’m pretty sure she does it in the dead of night, under the cover of darkness, like some kind of covert operation. The only clue? A tiny puddle and a look in her eyes that says, “You didn’t see anything.”",
            "Cats are notorious for not staying well-hydrated (same here).",
            "If you place a cat's water bowl next to their food, studies have shown that they will actually drink significantly less water. This behavior can be traced back to their wild instincts, as cat behaviorists suggest.",
            "In the wild, cats typically hunt far from their water sources, as they want to avoid contaminating it with the scent of food. Additionally, cats are sensitive creatures and the presence of food near their water or food particles floating in their water can be a huge turn-off.",
            "Cats prefer a clean, separate space for drinking to fully enjoy their water.",
            "To help keep your feline friend hydrated and content, try placing their water bowl in a different location from their food. This small change can encourage them to drink more, which is essential for their health, especially for preventing urinary or kidney issues.",
            "So, next time you're setting up your cat’s feeding area, consider giving them a separate spot for their water. Your cat will surely appreciate the gesture and thank you with extra purrs!"
          ],
        "image": "juliet_coffee",
        "article": true
    },
    {
        "id": "5",
        "name": "How many litter boxes should I have?",
        "created_date": "January 31, 2025",
        "updated_date": "January 31, 2025",
        "category": "Home",
        "description": "Learn why multiple litter boxes are a must! From pee-spraying mishaps to stress-related issues, discover how giving your cats options can solve it all!",
        "content": [
            "Why should you have multiple litter boxes? Good question.",
            "First let me tell you about me learning this lesson the hard way.",
            "In our condo right now, we don’t have a lot of room. We have two cats & two litter boxes — which are right next to each other. In the past, we’ve had 2 or 3 litter boxes, which were always placed in multiple locations so the gals had options.",
            "Well — now that they don’t have options, we’ve developed some problems.",
            "Problem #1: Juliet has decided to start peeing as if she’s shooting for the stars. The pee spray goes so high it ends up on the wall :) we had to get special litter boxes with high walls & a lid to deal with this issue.",
            "Problem #2: Due to litter box stress, Olivia has decided to stop burying/covering her bathrooms. Besides this being gross & smelly — sometimes she or Juliet steps in the wet pee & then proceeds to track the pee mixed with litter goo mess all over the house for me to clean up (yay)!",
            "A good rule of thumb for litter boxes is to have one for each cat, plus one extra. So, if you have two cats, you should provide three litter boxes (and make sure to have them in at least two different locations). This setup ensures each cat has their own space and a backup if another cat is using one.",
            "The main reasons to do this are for avoiding stress / territorial issues.",
            "If one cat is using the litter box and the other feels they don’t have a safe place to go, it can cause significant stress. Cats can’t express this to us, but it’s a real concern. Sharing a litter box can lead to anxiety and even health issues like urinary problems, as they try to hold it in.",
            "Cats are highly territorial, especially when it comes to their bathroom spots. As I noticed with Juliet, she began spraying out of frustration because she didn’t feel there were enough options available.",
            "Providing multiple litter boxes is a simple way to keep your cats happy, healthy, and stress-free!"
          ],
        "image": "juliet_olivia_couch_2",
        "article": true
    },
    {
        "id": "6",
        "name": "Using a flea treatment? BEWARE",
        "created_date": "January 31, 2025",
        "updated_date": "January 31, 2025",
        "category": "Care",
        "description": "After using Comfortis flea treatment on our cats, one had seizures, and I learned it's like applying bug killer to your pet. Here's what I found.",
        "content": [
            "When our cats were young, our vet recommended putting them on flea treatment (even though they were indoor only). Being naive & taking her word for it — I said “ok, sure” & started giving them Comfortis, a topical flea treatment.",
            "Almost immediately, one of our cats (Juliet) started having what seemed like mini-seizures. It was horrific. A trip to the emergency vet confirmed that she was having tremors/focal seizures. The emergency vet doctor also confirmed that it was caused by Comfortis.",
            "Soon after, I took Juliet to her regular vet (the one who put her on Comfortis). I told her about the tremors/focal seizures it caused & she nonchalantly said “oh yea, Comfortis can trigger seizures in about 40% of cats.”",
            "You could say I was furious, and let’s just say she certainly heard how I felt, as I made a conscious effort to hold back from completely losing it.",
            "Shocked (and still pissed off) I did more research and discovered that Comfortis is essentially like applying Roundup bug killer to your pet. Would you use Roundup on yourself or your kids?",
            "UMMM HOW ABOUT NOOOO.",
            "My cat still suffers from focal seizures eight years later, and Comfortis has been discontinued.",
            "I stopped using flea treatments altogether. Since our cats are indoor-only and don't face flea risks, I’ve received approval from top holistic vets to avoid these treatments. However, if your cats go outdoors or live with dogs, consider exploring holistic alternatives instead of topical treatments."
          ],
        "image": "juliet_ball_bop",
        "article": true
    },
    {
        "id": "7",
        "name": "NEVER use oil diffusers in a house with pets",
        "created_date": "January 31, 2025",
        "updated_date": "January 31, 2025",
        "category": "Health",
        "description": "Think essential oils are safe for pets? Think again. A vet’s urgent warning changed everything—find out why you should unplug yours now!",
        "content": [
            "I thought the idea of getting one of those cool oil diffuser things would be nice. Having a good smell coming from the occasional little scented air “poof” seemed like it would give me a spa-like experience in my apartment so I bought one from Amazon.",
            "Before using it, I went to Google to search “oils to use in an oil diffuser that are safe for pets.” I found plenty of articles listing all of these different oils that people claimed are “safe” for pets. So I bought one of them & started using the diffuser. It was nice. Smelled good & I got the spa-like experience I was hoping for.",
            "At the time, my two cat gals & I lived in an apartment in San Francisco. They had this cool “mobile vet” service where you could schedule a vet to come to your house for exams, vaccines, etc. I scheduled one of these appointments & a vet from Berkley came to our apartment. It was a great experience (not having to pack the gals up into the car, which usually stresses them out). They were much more relaxed having the exam at home in their own space.",
            "Anywho — during the appointment, the vet noticed my essential oil diffuser running. As soon as she saw it she said \"UNPLUG THAT. TURN IT OFF. And wipe your floors since the oils are being sprayed into the air & landing on your floor!\" I said — \"oh no, really? I did a ton of research on the internet & made sure to only buy the essential oils that claim to be safe for pets.\"",
            "She said ALL essential oils are bad for pets & that anything on the internet saying otherwise is wrong. Using these diffusers with essential oils around pets can cause neurological & organ damage, resulting in premature death. The Berkley Veterinary program is one of the best in the nation so personally — I’m taking her word for it."
          ],
        "image": "juliet_olivia_window_sil_high",
        "article": true
    },
    {
      "id": "8",
      "name":"Pet Asthma Guide",
      "created_date": "January 31, 2025",
      "updated_date": "January 31, 2025",
      "category": "Health",
      "description": "Does your beloved cat or dog suffer from asthma? Are you overwhelmed by conflicting advice and searching for a clear, comprehensive guide to keep your furry friend healthy, safe, and happy? Look no further!",
      "content": [
        "<p>Does your beloved cat or dog suffer from asthma? Are you overwhelmed by conflicting advice and searching for a clear, comprehensive guide to keep your furry friend healthy, safe, and happy? Look no further!</p>",
        "<p>Introducing <strong>The Ultimate Guide to Managing Pet Asthma</strong> – the must-have eBook for every pet parent navigating this condition.<p>",
        "<h3><strong>Discover the Secrets to a Healthier, Happier Pet</strong></h3><br>",
        "<h4><strong>What’s Inside:</strong></h4><br>",
        "<p>✅ <strong>Causes &amp; Triggers</strong> – Learn what sparks asthma attacks and how to reduce exposure.<br>✅ <strong>Essential Products</strong> – Find the best asthma-friendly products and avoid harmful ones that could make symptoms worse.<br>✅ <strong>Recognizing an Asthma Attack</strong> – Spot the warning signs early to prevent emergencies.<br>✅ <strong>Step-by-Step Inhaler Instructions</strong> – Master how to properly use an inhaler for both cats and dogs.<br>✅ <strong>Diagnosis &amp; Treatment Options</strong> – Understand vet-recommended medications, holistic treatments, and a supplement that helps.<br>✅ <strong>Household Hazards to Avoid</strong> – Everyday items that could be triggering your pet’s asthma.<br>✅ <strong>When to Seek Urgent Care</strong> – Know when it’s time for emergency intervention.<br>✅ <strong>Lifestyle Tips</strong> – Simple changes that can improve your pet’s breathing and overall well-being.</p>",
        "<p><em>Inspired by my sweet Juliet, whose asthma journey led me to create this guide.</em></p>",
        "<p>Help your pet breathe easier — <a href=\"https:\/\/julietsmom.gumroad.com\/l\/ksxoz\" target=\"_blank\" rel=\"noopener noreferrer\">get your copy today</a>!</p>"
      ],
      "image":"petasthmaguide",
      "article": false
    }
]

